# GeomStepFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RegenFailures..::..GeomStepFailed Property
BuiltInFailures..::..RegenFailures Class See Also
---
Can't rebuild geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GeomStepFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GeomStepFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GeomStepFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RegenFailures Class
Autodesk.Revit.DB Namespace